Revit 2026 API

# STEPExportOptions Properties

---

The STEPExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationProtocol | The Application Protocol of the exported STEP file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BIMExportOptions) |
|  | TargetUnit | The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. (Inherited from BIMExportOptions) |

#### Reference

STEPExportOptions Class

Autodesk.Revit.DB Namespace